org/syllabus.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-23 Sun 16:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction to Programming with Python</title>
<meta name="author" content="Marcus Birkenkrahe (birkenkrahe@lyon.edu)" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Introduction to Programming with Python
<br />
<span class="subtitle">Lyon College, Summer term I 2023, CSC 109</span>
</h1>
<p>
This four-week course is designed to provide students with a
comprehensive introduction to programming in Python, covering
fundamental concepts and practical applications of the language. Using
"Python Crash Course" by Eric Matthes as the textbook, students will
learn how to install Python and an IDE, and get started with basic
data types, control flow statements, functions, files, and
exceptions. They will also gain hands-on experience with more advanced
topics such as object-oriented programming, modules and packages,
testing and debugging, and data analysis and visualization.
</p>

<p>
The second half of the course will focus on game development with the
Pygame library, starting with basic game framework development and
gradually building up to a fully functional "space invaders" game. In
addition, students will learn how to use Matplotlib and Seaborn to
create visualizations for data analysis, and how to use Pandas to
manipulate and analyze data.
</p>

<p>
Throughout the course, students will have ample opportunity to
practice their programming skills with a variety of exercises and
projects using the Google Colaboratory and DataCamp platforms. They
will also receive guidance and feedback from the instructor on their
progress and final projects. By the end of the course, students should
have a solid foundation in Python programming and be able to apply
their skills to a wide range of projects, from game development to
data analysis and visualization. This course is ideal for anyone with
little or no programming experience who wants to learn Python or for
those who have some experience in programming and want to learn more
advanced concepts and practical applications.
</p>

<div id="outline-container-orgef66fc5" class="outline-3">
<h3 id="orgef66fc5">Week 1</h3>
<div class="outline-text-3" id="text-orgef66fc5">
</div>
<div id="outline-container-org46e8279" class="outline-4">
<h4 id="org46e8279">Day 1 (2 hours)</h4>
<div class="outline-text-4" id="text-org46e8279">
<ul class="org-ul">
<li>Introductions</li>
<li>Overview of course and expectations</li>
<li>Installing Python and IDE (Integrated Development Environment)</li>
<li>Getting started with Python interpreter and basic data types</li>
</ul>
</div>
</div>
<div id="outline-container-orgb467dcf" class="outline-4">
<h4 id="orgb467dcf">Day 2 (2 hours)</h4>
<div class="outline-text-4" id="text-orgb467dcf">
<ul class="org-ul">
<li>Review of Python syntax and data types</li>
<li>Introduction to control flow statements (if/else, while, for)</li>
<li>Exercises using control flow statements</li>
</ul>
</div>
</div>
<div id="outline-container-org3fac957" class="outline-4">
<h4 id="org3fac957">Day 3 (2 hours)</h4>
<div class="outline-text-4" id="text-org3fac957">
<ul class="org-ul">
<li>Review of control flow statements</li>
<li>Introduction to functions and parameters</li>
<li>Exercises using functions and parameters</li>
</ul>
</div>
</div>
<div id="outline-container-orgba18004" class="outline-4">
<h4 id="orgba18004">Day 4 (2 hours)</h4>
<div class="outline-text-4" id="text-orgba18004">
<ul class="org-ul">
<li>Review of functions and parameters</li>
<li>Introduction to files and exceptions</li>
<li>Exercises using files and exceptions</li>
</ul>
</div>
</div>

<div id="outline-container-orgcf6854c" class="outline-4">
<h4 id="orgcf6854c">Day 5 (2 hours)</h4>
<div class="outline-text-4" id="text-orgcf6854c">
<ul class="org-ul">
<li>Review of files and exceptions</li>
<li>Introduction to lists</li>
<li>Exercises using lists</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org99708a2" class="outline-3">
<h3 id="org99708a2">Week 2</h3>
<div class="outline-text-3" id="text-org99708a2">
</div>
<div id="outline-container-orgcfb5e08" class="outline-4">
<h4 id="orgcfb5e08">Day 6 (2 hours)</h4>
<div class="outline-text-4" id="text-orgcfb5e08">
<ul class="org-ul">
<li>Review of lists</li>
<li>Introduction to dictionaries</li>
<li>Exercises using dictionaries</li>
</ul>
</div>
</div>
<div id="outline-container-org8f15fcc" class="outline-4">
<h4 id="org8f15fcc">Day 7 (2 hours)</h4>
<div class="outline-text-4" id="text-org8f15fcc">
<ul class="org-ul">
<li>Review of dictionaries</li>
<li>Introduction to tuples</li>
<li>Exercises using tuples</li>
</ul>
</div>
</div>
<div id="outline-container-orgf5e7961" class="outline-4">
<h4 id="orgf5e7961">Day 8 (2 hours)</h4>
<div class="outline-text-4" id="text-orgf5e7961">
<ul class="org-ul">
<li>Review of tuples</li>
<li>Introduction to classes and objects</li>
<li>Exercises using classes and objects</li>
</ul>
</div>
</div>
<div id="outline-container-org6dc9885" class="outline-4">
<h4 id="org6dc9885">Day 9 (2 hours)</h4>
<div class="outline-text-4" id="text-org6dc9885">
<ul class="org-ul">
<li>Review of classes and objects</li>
<li>Introduction to inheritance</li>
<li>Exercises using inheritance</li>
</ul>
</div>
</div>
<div id="outline-container-org98654b8" class="outline-4">
<h4 id="org98654b8">Day 10 (2 hours)</h4>
<div class="outline-text-4" id="text-org98654b8">
<ul class="org-ul">
<li>Review of inheritance</li>
<li>Introduction to modules and packages</li>
<li>Exercises using modules and packages</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5583d44" class="outline-3">
<h3 id="org5583d44">Week 3</h3>
<div class="outline-text-3" id="text-org5583d44">
</div>
<div id="outline-container-org1d01624" class="outline-4">
<h4 id="org1d01624">Day 11 (2 hours)</h4>
<div class="outline-text-4" id="text-org1d01624">
<ul class="org-ul">
<li>Review of modules and packages</li>
<li>Introduction to testing and debugging</li>
<li>Exercises using testing and debugging techniques</li>
</ul>
</div>
</div>
<div id="outline-container-orgfcc0cfc" class="outline-4">
<h4 id="orgfcc0cfc">Day 12 (2 hours)</h4>
<div class="outline-text-4" id="text-orgfcc0cfc">
<ul class="org-ul">
<li>Review of testing and debugging</li>
<li>Introduction to data visualization with Python</li>
<li>Exercises using Matplotlib to create visualizations</li>
</ul>
</div>
</div>

<div id="outline-container-orgd9e1db0" class="outline-4">
<h4 id="orgd9e1db0">Day 13 (2 hours)</h4>
<div class="outline-text-4" id="text-orgd9e1db0">
<ul class="org-ul">
<li>Review of data visualization with Python</li>
<li>Introduction to Pygame library</li>
<li>Exercises using Pygame to build a basic game framework</li>
</ul>
</div>
</div>
<div id="outline-container-org2ca6d25" class="outline-4">
<h4 id="org2ca6d25">Day 14 (2 hours)</h4>
<div class="outline-text-4" id="text-org2ca6d25">
<ul class="org-ul">
<li>Review of Pygame library</li>
<li>Introduction to game sprites and animation</li>
<li>Exercises using game sprites and animation to develop a basic game</li>
</ul>
</div>
</div>
<div id="outline-container-orgd15e9cb" class="outline-4">
<h4 id="orgd15e9cb">Day 15 (2 hours)</h4>
<div class="outline-text-4" id="text-orgd15e9cb">
<ul class="org-ul">
<li>Review of game development with Pygame</li>
<li>Introduction to game logic and event handling</li>
<li>Exercises using game logic and event handling to develop a simple "space invaders" game</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org565b28e" class="outline-3">
<h3 id="org565b28e">Week 4</h3>
<div class="outline-text-3" id="text-org565b28e">
</div>
<div id="outline-container-org77b2116" class="outline-4">
<h4 id="org77b2116">Day 16 (2 hours)</h4>
<div class="outline-text-4" id="text-org77b2116">
<ul class="org-ul">
<li>Review of "space invaders" game development</li>
<li>Introduction to debugging and optimization techniques for games</li>
<li>Exercises using debugging and optimization techniques to improve the
"space invaders" game</li>
</ul>
</div>
</div>
<div id="outline-container-orgbb385c6" class="outline-4">
<h4 id="orgbb385c6">Day 17 (2 hours)</h4>
<div class="outline-text-4" id="text-orgbb385c6">
<ul class="org-ul">
<li>Review of game development with Pygame</li>
<li>Introduction to advanced data visualization with Python</li>
<li>Exercises using Seaborn to create more complex visualizations</li>
</ul>
</div>
</div>
<div id="outline-container-orgdbeab1b" class="outline-4">
<h4 id="orgdbeab1b">Day 18 (2 hours)</h4>
<div class="outline-text-4" id="text-orgdbeab1b">
<ul class="org-ul">
<li>Review of advanced data visualization with Python</li>
<li>Introduction to data analysis with Python</li>
<li>Exercises using Pandas to manipulate and analyze data</li>
</ul>
</div>
</div>
<div id="outline-container-org4713a80" class="outline-4">
<h4 id="org4713a80">Day 19 (2 hours)</h4>
<div class="outline-text-4" id="text-org4713a80">
<ul class="org-ul">
<li>Review of data analysis with Python</li>
<li>Final project development</li>
<li>Discussion and review of final project progress</li>
</ul>
</div>
</div>
<div id="outline-container-org7307e77" class="outline-4">
<h4 id="org7307e77">Day 20 (2 hours)</h4>
<div class="outline-text-4" id="text-org7307e77">
<ul class="org-ul">
<li>Final project presentation</li>
<li>Review and feedback on final projects</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7af2bc1" class="outline-2">
<h2 id="org7af2bc1">Standard and course policies</h2>
<div class="outline-text-2" id="text-org7af2bc1">
<ul class="org-ul">
<li><b>Standard Lyon College Policies</b> are incorporated into this syllabus
and can be found at: <a href="http://www.lyon.edu/standard-course-policies">lyon.edu/standard-course-policies</a>.</li>

<li>The <b>Assignments and Honor Code</b> and the <b>Attendance Policy</b> are
incorporated into this syllabus also and can be found at:
<a href="https://tinyurl.com/LyonPolicy">tinyurl.com/LyonPolicy</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org3078d82" class="outline-2">
<h2 id="org3078d82">DataCamp</h2>
<div class="outline-text-2" id="text-org3078d82">
<p>
The course includes a free subscription to the DataCamp classroom at
<a href="https://datacamp.com/">datacamp.com</a> for assignments, and the opportunity to earn a
certificate.
</p>
</div>
</div>

<div id="outline-container-orgbd6bd46" class="outline-2">
<h2 id="orgbd6bd46">Google Colaboratory</h2>
<div class="outline-text-2" id="text-orgbd6bd46">
<p>
Google Colab (<a href="https://colab.research.google.com/">colab.research.google.com/</a>) is a (free) online platform
to create, edit and run interactive notebooks in R or Python. This
enables students to learn literate programming techniques. All
code-along and practice exercises for this class will be on Google
Colab.
</p>
</div>
</div>

<div id="outline-container-org1d8b112" class="outline-2">
<h2 id="org1d8b112">GitHub</h2>
<div class="outline-text-2" id="text-org1d8b112">
<p>
All course materials are available as <code>ipynb</code>, <code>org</code> and <code>pdf</code> files in a
GitHub repository (<a href="https://github.com/birkenkrahe/py">github.com/birkenkrahe/py</a>). GitHub is the premier
online platform for software development.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Marcus Birkenkrahe (birkenkrahe@lyon.edu)</p>
<p class="date">Created: 2023-04-23 Sun 16:37</p>
</div>
</body>
</html>